package KI304.Chumak.Lab3.interfaces;

/**
 * Інтерфейс Commandable представляє спеціальні функціональності для
 * командирського протигазу, включаючи можливість виконувати команди,
 * увімкнення режиму надзвичайної ситуації та передачу команд.
 */
public interface Commandable {

    /**
     * Виконує конкретну команду для командирського протигазу.
     */
    void executeCommand();

    /**
     * Увімкнення режиму надзвичайної ситуації.
     */
    void enableEmergencyMode();

    /**
     * Вимкнення режиму надзвичайної ситуації.
     */
    void disableEmergencyMode();

    /**
     * Перевірка поточного рівня заряду батареї.
     *
     * @return поточний рівень заряду батареї
     */
    int checkBatteryLevel();

    /**
     * Трансляція команди або повідомлення через систему зв'язку протигазу.
     *
     * @param message команда або повідомлення для трансляції
     */
    void broadcastCommand(String message);
}