package KI304.Chumak.Lab3;

/**
 * Клас Valve представляє клапан протигазу.
 * Клапан може бути відкритим або закритим.
 */
public class Valve {
    private boolean isOpen;  // Статус клапана (відкритий чи закритий)

    /**
     * Конструктор за замовчуванням.
     * Ініціалізує клапан як закритий.
     */
    public Valve() {
        this.isOpen = false; // Ініціалізуємо клапан як закритий
    }

    /**
     * Метод для перевірки, чи клапан відкритий.
     *
     * @return true, якщо клапан відкритий, false — якщо клапан закритий.
     */
    public boolean isOpen() {
        return isOpen;
    }

    /**
     * Метод для відкриття клапана.
     * Встановлює статус клапана як відкритий.
     */
    public void open() {
        isOpen = true;
    }

    /**
     * Метод для закриття клапана.
     * Встановлює статус клапана як закритий.
     */
    public void close() {
        isOpen = false;
    }
}